#include <iostream>
#include <Windows.h>
#include <conio.h>
#include "Player.h"
#include "Menu.h"
#include<string>

using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	int x = 5; int y = 5, i = 0;		
	char Ch;
	char ch = 'X';
	int c = 0;//змінна для вибору кольору
	string name1;//змінні для
	string name2;//імен гравців

	Pole pole;//створює об'єкт класу поле для першого гравця
	Player player;//створює об'єкт класу гравець перший 
	Menu menu;//створює об'єкт класу меню

	menu.Avake(); //вивожу надпис із зміненим фоном
	Sleep(15000); system("cls");//роблю паузу і чищу косоль

	menu.Avakes(0);//фон консолі
	cout << "\n\n\n\n\n\n\n\n\n\n\n\n\t\t\tЗавантаження. . . . ." << endl;//створюю враження завантаження гри
	Sleep(20000); system("cls");//роблю паузу і чищу косоль
	menu.Avakes(0);//повертаю стоковий вигляд консолі

	cout << "Виберіть фон та колір тексту який буде під час гри " << endl;
	cout << "0-стокова консоль\n1- чорні букви на  ліловому фоні \n2-жовті букви на синьому фоні\n3-чорні букви на білому фоні\n4-червоні букви на зеленому кольорі\n5-коричневі букви на світло смарагдовому фоні" <<endl ;
	cin >> c; cin.ignore(100, '\n');//ігноруєм розрив рядка інакше наступна фраза не введеться а перекина далі
	menu.Avakes(c);//змінюю колір консолі
	system("cls");//чищу консоль

	cout << "Введіть ім'я першого гравця :" << endl;
	getline(cin, name1); cout << endl; system("cls");//щитую введені
	cout << "Введіть ім'я другого гравця :" << endl;
	getline(cin, name2); cout << endl; system("cls");//імена граців

	//menu.Avakes(c);
	cout << "\n\n\n\n\n\n\n\n\n\n\n\n\t\t\tЗавантаження. . . . ." << endl; //створюю враження завантаження гри
	Sleep(10000);//затримка
	system("cls");// очищення консолі
	menu.instruction();//вивожу інструкцію 
	Sleep(120000);//затримка
	system("cls");// очищення консолі
	cout << "\n\n\t\tРозтановка кораблів" << endl;
	
	while (pole.getAmount() != true) //цикл робить доти доки на полі не буде зайнято 20 клітинок(така кількість всіх палуб кораблів)
	{
		char key = _getch();//записуєм в зміну нажату клавішу
		if (key == 'w') x--;//що відбувається 
		if (key == 's') x++;//під час
		if (key == 'a') y--;//нажаття 
		if (key == 'd') y++;//клавіш віжповідних
		if (key == 'H' || key == 'h') { menu.instruction(); Sleep(120000); }//якщо гравець захоче ще раз прочитати правила 
		if (x == 0 or x == 12 - 1 or y == 0 or y == 12 - 1) //умова,за якої при виході за межі поля, вказівник повертається на встановленні координати
		{
			x = 5;
			y = 5;
		}
		if (key == 'c') //заходим коли гравець надав клаішу 'c'
		{
			ch = 'X';
			player.setX(x);//записуєм координати
			player.setY(y);//на яких вказівник стоїть 
			player.setCh(ch);//передаєм яким значком заповнимо клітинку
			system("cls");

			pole.printPole(player);//друк поля під час розтановки караблів
		}
		else {
			system("cls");
			pole.printPole(x, y, '*');//друк поля під час руху по ньому
		}
		cout << "\n\n\t\tЗараз кораблі розтавляє - " <<name1<< endl;
		Sleep(100);
	}
	system("cls");

	Pole pole2;//створює об'єкт класу поле для другого гравця
	Player player2;//створює об'єкт класу гравець перший 

	while (pole2.getAmount() != true)//цикл робить доти доки на полі не буде зайнято 20 клітинок(така кількість всіх палуб кораблів)
	{
		char key = _getch();//зміна отримує нажату клавішу
		if (key == 'w') x--;//що відбувається
		if (key == 's') x++;//під час
		if (key == 'a') y--;//нажаття 
		if (key == 'd') y++;//клавіш віжповідних
		if (key == 'H' || key == 'h') { menu.instruction(); Sleep(120000); }//якщо гравець захоче ще раз прочитати правила 
		if (x == 0 or x == 12 - 1 or y == 0 or y == 12 - 1)//умова,за якої при виході за межі поля, вказівник повертається 
		{
			x = 5;
			y = 5;
		}
		if (key == 'c')
		{
			ch = 'X';
			player2.setX(x);
			player2.setY(y);
			player2.setCh(ch);
			system("cls");

			pole2.printPole(player2);
		}
		else{
			system("cls");
			pole2.printPole(x, y, '*');
		}
		cout << "\n\n\t\tЗараз кораблі розтавляє - "<<name2 << endl;
		Sleep(100);
	}
	system("cls");

	Pole pole11;//створює об'єкт класу поле ,для першого гравця
	Pole Pole22;//створює об'єкт класу поле, для другого гравця

	while (true)
	{	char key = _getch();//зміна отримує нажату клавішу
		if (key == 'w') x--;//що відбувається
		if (key == 's') x++;//під час
		if (key == 'a') y--;//нажаття 
		if (key == 'd') y++;//клавіш віжповідних
		if (key == 'H' || key == 'h') { menu.instruction(); Sleep(120000); }//якщо гравець захоче ще раз прочитати правила 
		if (x == 0 or x == 12 - 1 or y == 0 or y == 12 - 1)//умова,за якої при виході за межі поля, вказівник повертається 
		{
			x = 5;
			y = 5;
		}

		if (key == 'c' && i == 0)
		{	Ch = '0';//встановлюю яким знаком буде відмічатись удачний вистріл
		    static int j = 0;//роблю змінну статичною щоб значення змінювалось а не обнулювалось кожен раз
			player.setX(x);//те саме
			player.setY(y);//що і при 
			player.setCh(Ch);//розтановці кораблів
			system("cls");

			pole11.printPoleGame(player, pole2);//викликаю метод гри для першого граця
			cout << name1 << endl; Sleep(100);
			if (pole11.getShot(player, pole2) == false)//перевірка чи вистріл попав чи ні
			{
				i = 1;
				cout << "Не попав" << endl;
			}
			else
			{
				i = 0;
				cout << "Попав" << endl;
				cout << "Підбито " << ++j << " палуб противника з 20 " << endl;
				Sleep(1000);//роблю затримку щоб було що потомлено всі 20 палуб
			}
			if (pole11.getWinner() == true) { //перевірка на виграш //якщо гравець виграв спрацьовує брейк і зупиняє цикл
			system("cls"); 
			cout << "Переміг гравець : " << name1 << endl;
			cout << "Ви чудовий капітан ,потопили весь флот суперника " << endl; break;
			}
			Sleep(1000);//роблю затримку щоб було видно як походив перший гравець 
			key = 0;//потрібно присвоїти змінній key інше значееня бо інакше коли гравець1 промахується то його вистріл відмічається не лише в нього на полі бою а й на його полі де розтавленні його караблики а не противника  
		}
		if (key == 'c' && i == 1)
		{	Ch = 'O';//встановлюю яким знаком буде відмічатись удачний вистріл
		    static int j = 0;//роблю змінну статичною щоб значення змінювалось а не обнулювалось кожен раз
		    player2.setX(x);//те саме
		    player2.setY(y);//що і при 
		    player2.setCh(Ch);//розтановці кораблів
			system("cls");

			Pole22.printPoleGames(player2, pole);//викликаю метод гри для першого граця
			cout << name2 << endl; Sleep(100);
			if (Pole22.getShot(player2, pole) == false)//перевірка чи вистріл попав чи ні
			{
				i = 0;
				cout << "Не попав" << endl;
			}
			else
			{
				i = 1;
				cout << "Попав" << endl;
				cout << "Підбито " << ++j << " палуб противника з 20 " << endl;
				Sleep(1000);//роблю затримку щоб було що потомлено всі 20 палуб
			}
			if (Pole22.getWinner() == true) {//перевірка на виграш //якщо гравець виграв спрацьовує брейк і зупиняє цикл
				system("cls"); 
				cout << "Переміг гравець : " << name2 << endl;
				cout << "Ви чудовий капітан ,потопили весь флот суперника " << endl; break;
			}
		}
		else
		{
			system("cls");
			if (i == 0){
				pole11.printPole(x, y, '*');//викликаю метод руху по полю бою для першого грвця
			}
			else if (i == 1){
				Pole22.printPole(x, y, '*');//викликаю метод руху по полю бою для другого гравця
			}
		}		
	}
}