#include "Menu.h"
#include <iostream>
void Menu::instruction()//метод виводу правил гри
{
	std::cout << "\t\tШановні гравці , \nЗараз будуть пояснені правила гри ,читайте уважно та запамятовуйте.\nЯкщо щось забудете нажміть клавішу 'h' або 'H'." << std::endl;
	std::cout << "У кожного гравця є по 2 ігрових поля — розмірами  10 x 10.\nНа перших полях ви розтавляєте короблі." << std::endl;
	std::cout << "Розтановка відбувається почерзі, спершу перший гравець потім другий" << std::endl;
	std::cout << "Палуби кораблів які ви розтавляєте будуть відмічатися 'Х'" << std::endl;
	std::cout << "\nЗагалом є десять кораблів :" << std::endl;
	std::cout << "1 корабель — ряд із 4 клітин(«чотирипалубний»)\n2 кораблі — ряд із 3 клітин(«трипалубні»)\n3 кораблі — ряд із 2 клітин(«двопалубні»)\n4 кораблі — 1 клітина(«однопалубні»)." << std::endl;
	std::cout << "\nДоступно зайняти 20 клітинок не більше і не менше!\n" << std::endl;
	std::cout << "При розміщенні кораблі не можуть торкатися один одного кутами\n(однак якщови домовитесь заздалегіть  з іншим гравцем ,то це не заборонено)." << std::endl;
	std::cout << "За домовленістю,ви можете розтавити кораблі у вигляді квадрата(«чотирипалубні») \nабо літерою «Г»(«три - » та «чотирипалубні»).\n" << std::endl;
	std::cout << "Для переміщення по першому полю використовуй клавіши\n W - Вверх, S - Вниз, A - Ліворуч, D - Праворуч" << std::endl;
	std::cout << "Для встановлення палуби корабля використовуйте клавішу 'С'" << std::endl;

	std::cout << "\nНа других полях буде відбуватися бій!" << std::endl;
	std::cout << "Для переміщення по другому  полю використовуй клавіши\n W - Вверх, S - Вниз, A - Ліворуч, D - Праворуч; Для стрільби використовуйте клавішу 'С'" << std::endl;

	std::cout << "\n\t\tДля першого гравця:" << std::endl;
	std::cout << "Якщо ви влучили в корабель суперника то відповідна клітинка буде відмічена знаком '0',\nякщо ні ,то знаком '#' " << std::endl;
	std::cout << "\n\t\tДля другого гравця:" << std::endl;
	std::cout << "Якщо ви влучили в корабель суперника то відповідна клітинка буде відмічена знаком 'О',\nякщо ні ,то знаком '~' \n" << std::endl;
	std::cout << "Той, хто влучив, стріляє ще раз." << std::endl;

	std::cout << "\nПісля появи напису 'Розтановка кораблів' натисніть любу клавішу щоб розпочати розтаовку" << std::endl;

};